/* JavaScript历史
   创建人：布兰登·艾奇
   JavaScript是世界上最流行的语言之一，是一种运行在客户端的脚本语言
   脚本语言：不需要编译，运行过程中有jS解释器(js引擎)逐行来进行解释并执行
   现在也可以基于Node.js技术进行服务器端编程
   JavaScript的作用
	表单动态校验(密码强度检测)(js产生的最初目的)
	网页特效
	服务端开发
	桌面程序
	APP
	控制硬件-物联网(ruff)
	游戏开发
	html/css标记语言--描述类语言
	HTML决定网页结构和内容
	css决定网页程序给用户的模样
	
	js脚本语言--编程类语言
	实现业务逻辑和页面控制(决定功能)，
	
	浏览器执行JS的过程
	浏览器分成两部分 渲染引擎和JS引擎
	渲染引擎:用来解析HTML和CSS 俗称内核 比如Chrome浏览器的blink 老版本的webkit
	JS引擎：也称为JS解释器用来读取网页中的JavaScript代码 对齐进行处理后运行、
	比如Chrome浏览器的V8
	浏览器本身并不会执行JS代码 而是通过内置JavaScript引擎；来执行JS代码
	JS引擎执行代码是逐行解释每一句源码(转化为机器语言) 然后又计算机去执行
	所以JavaScript语言归为脚本语言 会逐行解释执行
	
	JS的组成
	ECMAScript JavaScript语法
	DOM   页面文档对象模型
	BOM   浏览器对象模型
	
	ECMAScript 是由ECMA国际(圆欧洲计算机制造商协会)进行标准化的一门编程语言
	这种语言在万维网上应用广泛 它忘完被称为JavaScript或JScript 但实际上后两者是ECMAscript语言的实现和扩展
	
	DOM 文档对象摩西是w3c组织推荐的处理可扩展标记语言的标准化编程接口
	通过DOM提供的接口可以对页面上的各种元素进行操作
	
	BOM 浏览器对象模型 它提供了独立于内容的 可以与浏览器窗口进行互动的对象结构 
	通过BOM可以操作浏览器窗口 比如弹出框 控制浏览器跳转 获取分辨率等
	
 */